app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" ORDER BY release_date
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'PG-13', 'R') ORDER BY release_date
---
  def index
    @all_ratings = Movie.ratings
    @ratings = (params[:ratings]) ? params[:ratings].keys : @all_ratings

    @sortby = params[:sort]
    @movies = Movie.order(@sortby)
    @movies = @movies.where(:rating => @ratings) unless @ratings.empty?